### Getting Started with pandas
- 시리즈(Series) / 데이터프레임(DataFrame)

In [31]:
# 문자열 데이터
wiseSay = [
    "삶이 있는 한 희망은 있다",
    "언제나 현재에 집중할 수 있다면 행복할 것이다",
    "신은 용기있는 자를 결코 버리지 않는다",
    "피할 수 없으면 즐겨라",
    "행복한 삶을 살기위해 필요한 것은 거의 없다",
    "내일은 내일의 태양이 뜬다",
    "계단을 밟아야 계단 위에 올라설 수 있다",
    "행복은 습관이다, 그것을 몸에 지니라",
    "1퍼센트의 가능성, 그것이 나의 길이다",
    "작은 기회로 부터 종종 위대한 업적이 시작된다" ]
wiseSay

['삶이 있는 한 희망은 있다',
 '언제나 현재에 집중할 수 있다면 행복할 것이다',
 '신은 용기있는 자를 결코 버리지 않는다',
 '피할 수 없으면 즐겨라',
 '행복한 삶을 살기위해 필요한 것은 거의 없다',
 '내일은 내일의 태양이 뜬다',
 '계단을 밟아야 계단 위에 올라설 수 있다',
 '행복은 습관이다, 그것을 몸에 지니라',
 '1퍼센트의 가능성, 그것이 나의 길이다',
 '작은 기회로 부터 종종 위대한 업적이 시작된다']

### Series
- pandas의 1차원 형태의 데이터로 인덱스를 가지는 구조

In [33]:
import pandas as pd
obj = pd.Series(wiseSay) # 문자열 데이터를 시리즈로 변환
print(obj) #시리즈 출력

0               삶이 있는 한 희망은 있다
1    언제나 현재에 집중할 수 있다면 행복할 것이다
2        신은 용기있는 자를 결코 버리지 않는다
3                 피할 수 없으면 즐겨라
4     행복한 삶을 살기위해 필요한 것은 거의 없다
5               내일은 내일의 태양이 뜬다
6       계단을 밟아야 계단 위에 올라설 수 있다
7         행복은 습관이다, 그것을 몸에 지니라
8        1퍼센트의 가능성, 그것이 나의 길이다
9    작은 기회로 부터 종종 위대한 업적이 시작된다
dtype: object

In [34]:
print(obj.index)
print('----------------')
print(obj.values)

RangeIndex(start=0, stop=10, step=1)
----------------
['삶이 있는 한 희망은 있다' '언제나 현재에 집중할 수 있다면 행복할 것이다' '신은 용기있는 자를 결코 버리지 않는다'
 '피할 수 없으면 즐겨라' '행복한 삶을 살기위해 필요한 것은 거의 없다' '내일은 내일의 태양이 뜬다'
 '계단을 밟아야 계단 위에 올라설 수 있다' '행복은 습관이다, 그것을 몸에 지니라' '1퍼센트의 가능성, 그것이 나의 길이다'
 '작은 기회로 부터 종종 위대한 업적이 시작된다']

In [35]:
import pandas as pd
import numpy as np
obj2 = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])
print(obj2)

a    4
b    7
c   -5
d    3
dtype: int64

In [36]:
obj2.dtype

dtype('int64')

In [37]:
obj2.dtypes

dtype('int64')

In [38]:
obj2.info

<bound method Series.info of a    4
b    7
c   -5
d    3
dtype: int64>

In [39]:
type(obj2)

pandas.core.series.Series

In [40]:
#시리즈 슬라이싱
print(obj2[0:2])
print(obj2['a':'c'])

a    4
b    7
dtype: int64
a    4
b    7
c   -5
dtype: int64

In [41]:
# in 
print('b' in obj2)
print('e' in obj2)

True
False

In [42]:
# 비교연산자
obj2 > 5

a    False
b     True
c    False
d    False
dtype: bool

In [43]:
# 비교연산자, 연산
print(obj2[obj2 > 0])
print(obj2 * 2)

a    4
b    7
d    3
dtype: int64
a     8
b    14
c   -10
d     6
dtype: int64

In [44]:
import pandas as pd
import numpy as np
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [45]:
for key, value in s.items():
    print(f'{key} 인구는 {value}명 입니다.')

서울 인구는 9904312명 입니다.
부산 인구는 3448737명 입니다.
인천 인구는 2890451명 입니다.
대구 인구는 2466052명 입니다.

In [46]:
#딕셔너리 값으로 시리즈 객체 생성
import pandas as pd
import numpy as np
s1 = pd.Series({"서울": 9904312, "부산": 3448737, "인천": 2890451, "대구": 2466052})
s1

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [47]:
# "울산" 값을 NaN으로 설정 : 결측치로 저장
s1["울산"] = np.nan
s1

서울    9904312.0
부산    3448737.0
인천    2890451.0
대구    2466052.0
울산          NaN
dtype: float64

In [48]:
pd.isnull(s1)

서울    False
부산    False
인천    False
대구    False
울산     True
dtype: bool

In [49]:
pd.notnull(s1)

서울     True
부산     True
인천     True
대구     True
울산    False
dtype: bool

In [50]:
s1[pd.notnull(s1)]

서울    9904312.0
부산    3448737.0
인천    2890451.0
대구    2466052.0
dtype: float64

In [51]:
s1[pd.isnull(s1)]

울산   NaN
dtype: float64

In [52]:
s1["인천"] = 2890451
s1

서울    9904312.0
부산    3448737.0
인천    2890451.0
대구    2466052.0
울산          NaN
dtype: float64

In [53]:
s1.head()

서울    9904312.0
부산    3448737.0
인천    2890451.0
대구    2466052.0
울산          NaN
dtype: float64

In [54]:
s1.head(2)

서울    9904312.0
부산    3448737.0
dtype: float64

In [55]:
s1.tail(2)

대구    2466052.0
울산          NaN
dtype: float64

### DataFrame
- pandas에서의 2차원 형태의 데이터 구조

In [57]:
import pandas as pd
import numpy as np
pd.DataFrame(wiseSay)

                           0
0             삶이 있는 한 희망은 있다
1  언제나 현재에 집중할 수 있다면 행복할 것이다
2      신은 용기있는 자를 결코 버리지 않는다
3               피할 수 없으면 즐겨라
4   행복한 삶을 살기위해 필요한 것은 거의 없다
5             내일은 내일의 태양이 뜬다
6     계단을 밟아야 계단 위에 올라설 수 있다
7       행복은 습관이다, 그것을 몸에 지니라
8      1퍼센트의 가능성, 그것이 나의 길이다
9  작은 기회로 부터 종종 위대한 업적이 시작된다

In [58]:
df1 = pd.DataFrame(wiseSay, columns =['명언'])
df1

                          명언
0             삶이 있는 한 희망은 있다
1  언제나 현재에 집중할 수 있다면 행복할 것이다
2      신은 용기있는 자를 결코 버리지 않는다
3               피할 수 없으면 즐겨라
4   행복한 삶을 살기위해 필요한 것은 거의 없다
5             내일은 내일의 태양이 뜬다
6     계단을 밟아야 계단 위에 올라설 수 있다
7       행복은 습관이다, 그것을 몸에 지니라
8      1퍼센트의 가능성, 그것이 나의 길이다
9  작은 기회로 부터 종종 위대한 업적이 시작된다

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 5 entries, ('d', 1) to ('e', 4)
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      float64
 1   b       4 non-null      float64
 2   c       4 non-null      float64
dtypes: float64(3)
memory usage: 542.0+ bytes

In [60]:
df.dtypes

a    float64
b    float64
c    float64
dtype: object

In [61]:
type(df)

pandas.core.frame.DataFrame

In [478]:
import pandas as pd
import numpy as np
# 데이터프레임 만들기 : numpy
df = pd.DataFrame(np.array([[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]]),
        columns=['a', 'b', 'c'])
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [485]:
import pandas as pd
import numpy as np
# 데이터프레임 만들기 : numpy
df = pd.DataFrame(np.arange(16).reshape(4,4),index=[1, 2, 3, 4],columns=['a', 'b', 'c','d'])        
df

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [62]:
import pandas as pd
# 데이터프레임 만들기 : 리스트
df = pd.DataFrame(
        [[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]],
        index=[1, 2, 3],
        columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [63]:
# 데이터프레임 만들기 : 딕셔너리, 넘파이
import pandas as pd
import numpy as np
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v'])
)
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [64]:
import pandas as pd
# 데이터프레임 만들기 : 딕셔너리
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                 '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
frame = pd.DataFrame(data)
frame

    이름  나이           생년월일
0  홍길동  21    2001년 1월 1일
1  이순신  22    2000년 5월 3일
2  김유신  25    1997년 7월 9일
3  정이동  23    1999년 6월 1일
4  이순진  24   1998년 9월 12일
5  박유정  20  2002년 12월 24일

In [65]:
frame.head(2)

    이름  나이         생년월일
0  홍길동  21  2001년 1월 1일
1  이순신  22  2000년 5월 3일

In [66]:
frame.tail(2)

    이름  나이           생년월일
4  이순진  24   1998년 9월 12일
5  박유정  20  2002년 12월 24일

In [67]:
frame.shape

(6, 3)

In [68]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   생년월일    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [69]:
frame.values

array([['홍길동', 21, '2001년 1월 1일'],
       ['이순신', 22, '2000년 5월 3일'],
       ['김유신', 25, '1997년 7월 9일'],
       ['정이동', 23, '1999년 6월 1일'],
       ['이순진', 24, '1998년 9월 12일'],
       ['박유정', 20, '2002년 12월 24일']], dtype=object)

In [70]:
frame.columns

Index(['이름', '나이', '생년월일'], dtype='object')

In [71]:
frame.index

RangeIndex(start=0, stop=6, step=1)

### 딕셔너리를 데이터프레임으로 만들기 : pd.DataFrame.from_dict() 함수 사용 
- from_dict() 함수는 딕셔너리를 입력 값으로 사용하고 데이터프레임을 반환한다. 
- 기본 동작은 딕셔너리의 키가 열 이름에 해당하고 값이 행 데이터에 해당한다고 가정한다.

In [94]:
student_data = {'name': ['Alice', 'Bob', 'Charlie'], 'grade': [95, 87, 92], 'subject': ['Math', 'English', 'Science']}
df = pd.DataFrame(student_data)
print(df)

      name  grade  subject
0    Alice     95     Math
1      Bob     87  English
2  Charlie     92  Science

In [95]:
student_data = {'name': ['Alice', 'Bob', 'Charlie'], 'grade': [95, 87, 92], 'subject': ['Math', 'English', 'Science']}
df = pd.DataFrame.from_dict(student_data)
print(df)

      name  grade  subject
0    Alice     95     Math
1      Bob     87  English
2  Charlie     92  Science

### 딕셔너리가 구조가 다른 경우 : orient 매개 변수 사용
- orient 매개 변수는 index, columns, split, values와 같은 여러 값을 허용한다. 
- 기본값은 columns입니다.

In [97]:
# 서로 다른 길이의 리스트를 포함하는 딕셔너리가 있는 경우
data = {'name': ['Alice', 'Bob', 'Charlie'], 'grade': [95, 87], 'subject': ['Math', 'English', 'Science']}
df = pd.DataFrame(data) # 오류발생
df

ValueError: All arrays must be of the same length

In [171]:
# 서로 다른 길이의 리스트를 포함하는 딕셔너리가 있는 경우
data = {'name': ['Alice', 'Bob', 'Charlie'], 'grade': [95, 87], 'subject': ['Math', 'English', 'Science']}
df = pd.DataFrame.from_dict(data) # 오류발생
df

ValueError: All arrays must be of the same length

In [278]:
# 서로 다른 길이의 리스트를 포함하는 딕셔너리가 있는 경우 :orient는 pd.DataFrame.from_dict()에서만 사용 가능
data = {'name': ['Alice', 'Bob', 'Charlie'], 'grade': [95, 87], 'subject': ['Math', 'English', 'Science']}
df = pd.DataFrame.from_dict(data, orient='index')
df

             0        1        2
name     Alice      Bob  Charlie
grade       95       87     None
subject   Math  English  Science

In [279]:
# 서로 다른 길이의 리스트를 포함하는 딕셔너리가 있는 경우
data = {'name': ['Alice', 'Bob', 'Charlie'], 'grade': [95, 87], 'subject': ['Math', 'English', 'Science']}
df = pd.DataFrame.from_dict(data, orient='index', columns=['A', 'B', 'C'])
df

             A        B        C
name     Alice      Bob  Charlie
grade       95       87     None
subject   Math  English  Science

In [280]:
df.T

      name grade  subject
A    Alice    95     Math
B      Bob    87  English
C  Charlie  None  Science

- 원하는 컬럼의 데이터 추출

In [487]:
import pandas as pd
# 데이터프레임 만들기 : 딕셔너리
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                 '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
frame = pd.DataFrame(data)
frame

    이름  나이           생년월일
0  홍길동  21    2001년 1월 1일
1  이순신  22    2000년 5월 3일
2  김유신  25    1997년 7월 9일
3  정이동  23    1999년 6월 1일
4  이순진  24   1998년 9월 12일
5  박유정  20  2002년 12월 24일

In [73]:
# 원하는 하나의 컬럼을 추출 : 시리즈 형태로 출력
frame['이름']

0    홍길동
1    이순신
2    김유신
3    정이동
4    이순진
5    박유정
Name: 이름, dtype: object

In [74]:
# 원하는 하나의 컬럼을 추출 : 시리즈 형태로 출력
frame.이름

0    홍길동
1    이순신
2    김유신
3    정이동
4    이순진
5    박유정
Name: 이름, dtype: object

In [75]:
# 원하는 하나의 컬럼을 추출 : 데이터프레임 형태(2차원)로 출력
frame[['이름']]

    이름
0  홍길동
1  이순신
2  김유신
3  정이동
4  이순진
5  박유정

In [76]:
# 원하는 컬럼들을 추출 : 데이터프레임 형태(2차원)로 출력
frame[['이름','나이']]  # 여러개의 컬럼 추출 시 리스트 형태로 표현함

    이름  나이
0  홍길동  21
1  이순신  22
2  김유신  25
3  정이동  23
4  이순진  24
5  박유정  20

In [77]:
# 값 추출 :데이터프레임[컬럼명][인데스명]
frame['이름'][1]

'이순신'

- 열 추가 : df['새 열이름'] = [값]

In [79]:
frame['학교'] = '울산대학교'
print(frame)
print('='*20)
frame['학점'] = '4.0'
print(frame)

    이름  나이           생년월일     학교
0  홍길동  21    2001년 1월 1일  울산대학교
1  이순신  22    2000년 5월 3일  울산대학교
2  김유신  25    1997년 7월 9일  울산대학교
3  정이동  23    1999년 6월 1일  울산대학교
4  이순진  24   1998년 9월 12일  울산대학교
5  박유정  20  2002년 12월 24일  울산대학교
====================
    이름  나이           생년월일     학교   학점
0  홍길동  21    2001년 1월 1일  울산대학교  4.0
1  이순신  22    2000년 5월 3일  울산대학교  4.0
2  김유신  25    1997년 7월 9일  울산대학교  4.0
3  정이동  23    1999년 6월 1일  울산대학교  4.0
4  이순진  24   1998년 9월 12일  울산대학교  4.0
5  박유정  20  2002년 12월 24일  울산대학교  4.0

- 열 삭제 : 하나의 열만 삭제 : del df['열이름']
- 또는    df.pop('열이름')

In [81]:
frame

    이름  나이           생년월일     학교   학점
0  홍길동  21    2001년 1월 1일  울산대학교  4.0
1  이순신  22    2000년 5월 3일  울산대학교  4.0
2  김유신  25    1997년 7월 9일  울산대학교  4.0
3  정이동  23    1999년 6월 1일  울산대학교  4.0
4  이순진  24   1998년 9월 12일  울산대학교  4.0
5  박유정  20  2002년 12월 24일  울산대학교  4.0

In [82]:
frame1 = pd.DataFrame(frame)
frame1

    이름  나이           생년월일     학교   학점
0  홍길동  21    2001년 1월 1일  울산대학교  4.0
1  이순신  22    2000년 5월 3일  울산대학교  4.0
2  김유신  25    1997년 7월 9일  울산대학교  4.0
3  정이동  23    1999년 6월 1일  울산대학교  4.0
4  이순진  24   1998년 9월 12일  울산대학교  4.0
5  박유정  20  2002년 12월 24일  울산대학교  4.0

In [83]:
#데이터프레임을 복사할 때는 .copy() 사용하기
frame2 = frame1.copy()
frame2

    이름  나이           생년월일     학교   학점
0  홍길동  21    2001년 1월 1일  울산대학교  4.0
1  이순신  22    2000년 5월 3일  울산대학교  4.0
2  김유신  25    1997년 7월 9일  울산대학교  4.0
3  정이동  23    1999년 6월 1일  울산대학교  4.0
4  이순진  24   1998년 9월 12일  울산대학교  4.0
5  박유정  20  2002년 12월 24일  울산대학교  4.0

In [84]:
frame2.pop('학점')
frame2

    이름  나이           생년월일     학교
0  홍길동  21    2001년 1월 1일  울산대학교
1  이순신  22    2000년 5월 3일  울산대학교
2  김유신  25    1997년 7월 9일  울산대학교
3  정이동  23    1999년 6월 1일  울산대학교
4  이순진  24   1998년 9월 12일  울산대학교
5  박유정  20  2002년 12월 24일  울산대학교

In [85]:
del frame2['학교']
frame2

    이름  나이           생년월일
0  홍길동  21    2001년 1월 1일
1  이순신  22    2000년 5월 3일
2  김유신  25    1997년 7월 9일
3  정이동  23    1999년 6월 1일
4  이순진  24   1998년 9월 12일
5  박유정  20  2002년 12월 24일

In [86]:
frame1

    이름  나이           생년월일     학교   학점
0  홍길동  21    2001년 1월 1일  울산대학교  4.0
1  이순신  22    2000년 5월 3일  울산대학교  4.0
2  김유신  25    1997년 7월 9일  울산대학교  4.0
3  정이동  23    1999년 6월 1일  울산대학교  4.0
4  이순진  24   1998년 9월 12일  울산대학교  4.0
5  박유정  20  2002년 12월 24일  울산대학교  4.0

In [87]:
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                 '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
columns = ['이름', '생년월일', '나이']
index=['one', 'two', 'three', 'four','five', 'six']
frame3 = pd.DataFrame(data, index=index, columns=columns)
frame3

        이름           생년월일  나이
one    홍길동    2001년 1월 1일  21
two    이순신    2000년 5월 3일  22
three  김유신    1997년 7월 9일  25
four   정이동    1999년 6월 1일  23
five   이순진   1998년 9월 12일  24
six    박유정  2002년 12월 24일  20

In [88]:
frame3.dtypes

이름      object
생년월일    object
나이       int64
dtype: object

- 지정된 위치에 열 삽입 : df.insert(위치, 열이름, [값1, 값2…])

In [90]:
frame3.insert(1, '성별', ['남','남','남','여','여','여'])
frame3

        이름 성별           생년월일  나이
one    홍길동  남    2001년 1월 1일  21
two    이순신  남    2000년 5월 3일  22
three  김유신  남    1997년 7월 9일  25
four   정이동  여    1999년 6월 1일  23
five   이순진  여   1998년 9월 12일  24
six    박유정  여  2002년 12월 24일  20

In [91]:
frame3.dtypes

이름      object
성별      object
생년월일    object
나이       int64
dtype: object

In [92]:
# 값 추출 :데이터프레임[컬럼명][인데스명]
frame3['이름']['two']

'이순신'

In [281]:
df['D'][3] #df[열이름][행이름]

KeyError: 'D'

#### 행 인덱싱 : 슬라이싱
- 인덱스번호나 인덱스이름 모두 가능

In [1]:
import pandas as pd

In [3]:
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
# frame = pd.DataFrame(data, index=['one', 'two', 'three', 'four','five', 'six'])
frame = pd.DataFrame(data)
frame

    이름  나이           생년월일
0  홍길동  21    2001년 1월 1일
1  이순신  22    2000년 5월 3일
2  김유신  25    1997년 7월 9일
3  정이동  23    1999년 6월 1일
4  이순진  24   1998년 9월 12일
5  박유정  20  2002년 12월 24일

In [39]:
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}

columns = ['이름', '생년월일', '나이']
index = ['one', 'two', 'three', 'four','five', 'six']
frame = pd.DataFrame(data, index = index, columns = columns)
frame

        이름           생년월일  나이
one    홍길동    2001년 1월 1일  21
two    이순신    2000년 5월 3일  22
three  김유신    1997년 7월 9일  25
four   정이동    1999년 6월 1일  23
five   이순진   1998년 9월 12일  24
six    박유정  2002년 12월 24일  20

In [5]:
frame[1:3]

        이름         생년월일  나이
two    이순신  2000년 5월 3일  22
three  김유신  1997년 7월 9일  25

In [7]:
frame[:3]

        이름         생년월일  나이
one    홍길동  2001년 1월 1일  21
two    이순신  2000년 5월 3일  22
three  김유신  1997년 7월 9일  25

In [8]:
frame[3:]

       이름           생년월일  나이
four  정이동    1999년 6월 1일  23
five  이순진   1998년 9월 12일  24
six   박유정  2002년 12월 24일  20

In [10]:
frame[:'four']

        이름         생년월일  나이
one    홍길동  2001년 1월 1일  21
two    이순신  2000년 5월 3일  22
three  김유신  1997년 7월 9일  25
four   정이동  1999년 6월 1일  23

In [14]:
frame['이름']['four'] # col x row

'정이동'

#### drop() : 1개 이상의 행, 열 삭제
    - 행 삭제 : df.drop(['행인덱스', '행인덱스',…], axis=0)
    - 또는  df.drop(index=[ '행인덱스', '행인덱스',…])
        - inplace = True  : DataFrame에 수정된 결과 반영 
        - 그렇지 않으면 원래 DataFrame 이 수정되지 않은 상태 유지 
    - 열 삭제 : df.drop(['열이름', '열이름',…], axis=1)
    - 또는  df.drop(columns=[ '열이름', '열이름',…])

In [30]:
frame.drop(['one', 'four'], axis = 0) # 생략시 => defalut : axis=0
# frame.drop(['one', 'four']) 같은 의미

        이름           생년월일  나이
two    이순신    2000년 5월 3일  22
three  김유신    1997년 7월 9일  25
five   이순진   1998년 9월 12일  24
six    박유정  2002년 12월 24일  20

In [28]:
frame.drop(['이름'], axis = 1)

                생년월일  나이
one      2001년 1월 1일  21
two      2000년 5월 3일  22
three    1997년 7월 9일  25
four     1999년 6월 1일  23
five    1998년 9월 12일  24
six    2002년 12월 24일  20

In [34]:
frame

        이름           생년월일  나이
one    홍길동    2001년 1월 1일  21
two    이순신    2000년 5월 3일  22
three  김유신    1997년 7월 9일  25
four   정이동    1999년 6월 1일  23
five   이순진   1998년 9월 12일  24
six    박유정  2002년 12월 24일  20

In [40]:
frame.drop(index=['two', 'six'], inplace=True)

In [41]:
frame

        이름          생년월일  나이
one    홍길동   2001년 1월 1일  21
three  김유신   1997년 7월 9일  25
four   정이동   1999년 6월 1일  23
five   이순진  1998년 9월 12일  24

In [366]:
# frame.drop(['나이', '생년월일']) # 오류 발생

In [367]:
# 여러개의 컬럼을 삭제할 경우 axis=1을 지정하여야 함
frame.drop(['나이', '생년월일'], axis=1)

        이름
one    홍길동
three  김유신
four   정이동
five   이순진

In [368]:
# 여러개의 컬럼을 삭제할 경우 columns을 지정하여도 된다
frame.drop(columns=['나이', '생년월일'])

        이름
one    홍길동
three  김유신
four   정이동
five   이순진

#### 컬럼명을 재지정하는 방법
- DataFrame.columns=['새이름1', '새이름2',...]
    - 전체변수 이름을 재설정한다.
    - 변수명을 차례로 재설정한다. 변수가 많은 경우 적절하지 않다
- DataFrame.rename(columns={'기존이름':'새이름'}, inplace=True)
    -원하는 변수이름만 수정할 수 있다
    - 딕셔너리 구조로 정의한다. 즉 이전 열이름을 키로 지정하고 새이름을 값으로 지정한다

In [42]:
import pandas as pd
import numpy as np

In [43]:
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                 '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
frame = pd.DataFrame(data, index=['one', 'two', 'three', 'four','five', 'six'])
frame

        이름  나이           생년월일
one    홍길동  21    2001년 1월 1일
two    이순신  22    2000년 5월 3일
three  김유신  25    1997년 7월 9일
four   정이동  23    1999년 6월 1일
five   이순진  24   1998년 9월 12일
six    박유정  20  2002년 12월 24일

In [44]:
frame1 = frame.copy()
frame1

        이름  나이           생년월일
one    홍길동  21    2001년 1월 1일
two    이순신  22    2000년 5월 3일
three  김유신  25    1997년 7월 9일
four   정이동  23    1999년 6월 1일
five   이순진  24   1998년 9월 12일
six    박유정  20  2002년 12월 24일

In [ ]:
# 방법1
columns = ['성명','나이','생일']
frame.columns = columns
frame

        성명  나이             생일
one    홍길동  21    2001년 1월 1일
two    이순신  22    2000년 5월 3일
three  김유신  25    1997년 7월 9일
four   정이동  23    1999년 6월 1일
five   이순진  24   1998년 9월 12일
six    박유정  20  2002년 12월 24일

In [374]:
#방법2
frame1.rename(columns={'이름':'성명','생년월일':'생일'}, inplace=True)
frame1

        성명  나이             생일
one    홍길동  21    2001년 1월 1일
two    이순신  22    2000년 5월 3일
three  김유신  25    1997년 7월 9일
four   정이동  23    1999년 6월 1일
five   이순진  24   1998년 9월 12일
six    박유정  20  2002년 12월 24일

#### 인덱스 변경 : index()

In [ ]:
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
frame2 = pd.DataFrame(data, index=['one', 'two', 'three', 'four','five', 'six'])
frame2

        이름  나이           생년월일
one    홍길동  21    2001년 1월 1일
two    이순신  22    2000년 5월 3일
three  김유신  25    1997년 7월 9일
four   정이동  23    1999년 6월 1일
five   이순진  24   1998년 9월 12일
six    박유정  20  2002년 12월 24일

In [48]:
# 인덱스 변경
frame2.index = ['일', '이', '삼', '사', '오', '육']
frame2

    이름  나이           생년월일
일  홍길동  21    2001년 1월 1일
이  이순신  22    2000년 5월 3일
삼  김유신  25    1997년 7월 9일
사  정이동  23    1999년 6월 1일
오  이순진  24   1998년 9월 12일
육  박유정  20  2002년 12월 24일

#### 인덱스 재지정 : reindex()

In [49]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [50]:
frame1 = frame.reindex(['a', 'b', 'c', 'd'])
frame1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [51]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'], fill_value = 0) # 결측치 지정
frame2

   Ohio  Texas  California
a     0      1           2
b     0      0           0
c     3      4           5
d     6      7           8

In [ ]:
frame3 = frame.reindex(['a', 'b', 'c', 'd'], fill_value = 'missing')
frame3

      Ohio    Texas California
a        0        1          2
b  missing  missing    missing
c        3        4          5
d        6        7          8

#### 인덱스 지정 : set_index()
- 기존 열을 사용하여 DataFrame의 인덱스를 설정
- 하나 이상의 기존 열 또는 배열(올바른 길이)을 사용하여 DataFrame 인덱스(행 레이블)를 설정. 
- 인덱스는 기존 인덱스를 대체하거나 확장할 수 있다.

In [61]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [62]:
df1 = pd.DataFrame(df.set_index('month'))
df1

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [63]:
df1.dtypes

year    int64
sale    int64
dtype: object

In [64]:
df1['year'][7]

2013

In [65]:
df2 = df.set_index(['year', 'month'])
df2

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

- 인덱스 혹은 인덱스 레벨을 리셋 : .reset_index()

In [66]:
df3 = df2.reset_index()
df3

   year  month  sale
0  2012      1    55
1  2014      4    40
2  2013      7    84
3  2014     10    31

#### 컬럼의 데이터 타입 변경 : astype()

In [67]:
import pandas as pd
import numpy as np

In [79]:
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['20010101','20000503', '19970709',
                 '19990601','19980912', '20021224'],
        '성별' : ['남', '여','여','남','여','남']}
df = pd.DataFrame(data, index=['one', 'two', 'three', 'four','five', 'six'])
df

        이름  나이      생년월일 성별
one    홍길동  21  20010101  남
two    이순신  22  20000503  여
three  김유신  25  19970709  여
four   정이동  23  19990601  남
five   이순진  24  19980912  여
six    박유정  20  20021224  남

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   생년월일    6 non-null      object
 3   성별      6 non-null      object
dtypes: int64(1), object(3)
memory usage: 240.0+ bytes

In [70]:
# 나이의 int형을 문자열(object 또는 str로 가능)로 변경 
df['나이'] = df['나이'].astype('object')
# df['나이'] = df['나이'].astype(str)도 가능

In [395]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      object
 2   생년월일    6 non-null      object
 3   성별      6 non-null      object
dtypes: object(4)
memory usage: 240.0+ bytes

In [80]:
# 생년월일의 object를  datetime64[ns]형으로 변경
df['생년월일']=df['생년월일'].astype('datetime64[ns]')

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   생년월일    6 non-null      datetime64[ns]
 3   성별      6 non-null      object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 240.0+ bytes

In [82]:
# 다른 방법: 날짜형(datetime64[ns])으로 변경할 때는 
# pd.to_datetime() 사용하여 변경하여도 됨
df['생년월일'] = pd.to_datetime(df['생년월일'])

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   생년월일    6 non-null      datetime64[ns]
 3   성별      6 non-null      object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 240.0+ bytes

In [84]:
df

        이름  나이       생년월일 성별
one    홍길동  21 2001-01-01  남
two    이순신  22 2000-05-03  여
three  김유신  25 1997-07-09  여
four   정이동  23 1999-06-01  남
five   이순진  24 1998-09-12  여
six    박유정  20 2002-12-24  남

In [85]:
# 성별 문자열(object)형을 범주형(category)로 변경
df['성별'] = df['성별'].astype('category')

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   생년월일    6 non-null      datetime64[ns]
 3   성별      6 non-null      category
dtypes: category(1), datetime64[ns](1), int64(1), object(1)
memory usage: 322.0+ bytes

In [87]:
# 나이 문자열(object)형을 원래 데이터형인 정수형(int64)로 다시 변경
df['나이'] = df['나이'].astype('int64')

# 정수형은 df['나이']= df['나이'].astype(int) 도 가능
# 실수형은  df['나이']= df['나이'].astype('float64') 또는
# df['나이']= df['나이'].astype(float) 도 가능
# 숫자형으로 변경할 때 df['나이']=pd.to_numeric(df['나이']) 도 가능

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   생년월일    6 non-null      datetime64[ns]
 3   성별      6 non-null      category
dtypes: category(1), datetime64[ns](1), int64(1), object(1)
memory usage: 322.0+ bytes

In [ ]:
# 날짜형으로 변경된 생년월일 컬럼에서 연도, 월, 일 추출하여 컬럼에 추가
# 날짜형식 활용 : Series.dt.형식
df['연도'] = df['생년월일'].dt.year
df['월'] = df['생년월일'].dt.month
df['일'] = df['생년월일'].dt.day

df

        이름  나이       생년월일 성별    연도   월   일
one    홍길동  21 2001-01-01  남  2001   1   1
two    이순신  22 2000-05-03  여  2000   5   3
three  김유신  25 1997-07-09  여  1997   7   9
four   정이동  23 1999-06-01  남  1999   6   1
five   이순진  24 1998-09-12  여  1998   9  12
six    박유정  20 2002-12-24  남  2002  12  24

#### 특정 행과 열의 기본처리 : loc
- loc 인덱서 : 
    - 행 하나에 접근 : df.loc[‘행 인덱스이름’] 
    - 셀 하나에 접근 : df.loc[‘행 인덱스이름’, ‘열 이름’] ,  또는 df.loc[‘행 인덱스이름’][‘열 이름’]
    - 행 추가 : df.loc[‘새인덱스이름’] = ([값1, 값2 …])
    - 기존 행 복사 : df.loc[‘행이름’] = df.loc[‘복사하려는 기존 인덱스’]

In [91]:
import pandas as pd
import numpy as np
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['20010101','20000503', '19970709',
                 '19990601','19980912', '20021224'],
        '성별' : ['남', '여','여','남','여','남']}
df = pd.DataFrame(data, index=['일', '이', '삼', '사', '오', '육'])
df

    이름  나이      생년월일 성별
일  홍길동  21  20010101  남
이  이순신  22  20000503  여
삼  김유신  25  19970709  여
사  정이동  23  19990601  남
오  이순진  24  19980912  여
육  박유정  20  20021224  남

In [94]:
df.loc["일"] # '일'행 추출. 시리즈 형태로 표시

이름           홍길동
나이            21
생년월일    20010101
성별             남
Name: 일, dtype: object

In [95]:
df.loc[["일"]]  # 행전체가 데이터 프레임으로 표시: [[]]

    이름  나이      생년월일 성별
일  홍길동  21  20010101  남

In [96]:
df.loc["일":"사"] # 연속적인 여러 행 표시 : [] 형태

    이름  나이      생년월일 성별
일  홍길동  21  20010101  남
이  이순신  22  20000503  여
삼  김유신  25  19970709  여
사  정이동  23  19990601  남

In [97]:
df.loc[["이","사"]] # 비연속적 여러 행 표시 : [[]] 형태  #df.loc["이","사"]입력시 오류발생

    이름  나이      생년월일 성별
이  이순신  22  20000503  여
사  정이동  23  19990601  남

In [98]:
df.loc[df.나이 > 23]
# df.loc[df['나이'] > 23]

    이름  나이      생년월일 성별
삼  김유신  25  19970709  여
오  이순진  24  19980912  여

In [99]:
df.loc["일", "이름"] # 셀 하나 표시 df.loc[행이름, 열이름]

'홍길동'

In [100]:
df.loc["일"]["이름"] # 셀 하나 표시 df.loc[행이름][열이름]

'홍길동'

In [101]:
df.loc["이":, "이름"]

이    이순신
삼    김유신
사    정이동
오    이순진
육    박유정
Name: 이름, dtype: object

In [107]:
df.loc["이", :]

이름           이순신
나이            22
생년월일    20000503
성별             여
지역            부산
Name: 이, dtype: object

In [103]:
df.loc[["이", "사"], ["이름", "나이"]]

    이름  나이
이  이순신  22
사  정이동  23

In [108]:
df['지역']='울산'  #열 추가
df

    이름  나이      생년월일 성별  지역
일  홍길동  21  20010101  남  울산
이  이순신  22  20000503  여  울산
삼  김유신  25  19970709  여  울산
사  정이동  23  19990601  남  울산
오  이순진  24  19980912  여  울산
육  박유정  20  20021224  남  울산

In [109]:
df['지역']=['울산', '부산', '서울', '광주', '대구','인천']  #열 추가
df

    이름  나이      생년월일 성별  지역
일  홍길동  21  20010101  남  울산
이  이순신  22  20000503  여  부산
삼  김유신  25  19970709  여  서울
사  정이동  23  19990601  남  광주
오  이순진  24  19980912  여  대구
육  박유정  20  20021224  남  인천

In [110]:
df.loc['팔'] = ['이이', 25, '19900909', '남', '서울']  # 행추가
df

    이름  나이      생년월일 성별  지역
일  홍길동  21  20010101  남  울산
이  이순신  22  20000503  여  부산
삼  김유신  25  19970709  여  서울
사  정이동  23  19990601  남  광주
오  이순진  24  19980912  여  대구
육  박유정  20  20021224  남  인천
팔   이이  25  19900909  남  서울

In [111]:
df.loc['칠'] = df.loc['오']  # 행추가
df

    이름  나이      생년월일 성별  지역
일  홍길동  21  20010101  남  울산
이  이순신  22  20000503  여  부산
삼  김유신  25  19970709  여  서울
사  정이동  23  19990601  남  광주
오  이순진  24  19980912  여  대구
육  박유정  20  20021224  남  인천
팔   이이  25  19900909  남  서울
칠  이순진  24  19980912  여  대구

In [112]:
df.loc[['이', '오'],['나이']] = 30
df

    이름  나이      생년월일 성별  지역
일  홍길동  21  20010101  남  울산
이  이순신  30  20000503  여  부산
삼  김유신  25  19970709  여  서울
사  정이동  23  19990601  남  광주
오  이순진  30  19980912  여  대구
육  박유정  20  20021224  남  인천
팔   이이  25  19900909  남  서울
칠  이순진  24  19980912  여  대구

In [ ]:
df.loc[:, ['이름']]

SyntaxError: invalid syntax (1472461142.py, line 1)

In [120]:
df.loc[:, ['이름', '나이', '성별', '지역']]

    이름  나이 성별  지역
일  홍길동  21  남  울산
이  이순신  30  여  부산
삼  김유신  25  여  서울
사  정이동  23  남  광주
오  이순진  30  여  대구
육  박유정  20  남  인천
팔   이이  25  남  서울
칠  이순진  24  여  대구

#### 행과 열의 기본처리 : iloc
- iloc 인덱서: loc인덱서와 사용법은 동일하나, 레이블이 아닌 순서를 나타내는 정수(integer) 인덱스 사용
  - 행 하나에 접근 : df.iloc[행번호]
  - 셀 하나에 접근 : df.iloc[행번호][열번호] 또는 df.iloc[행번호, 열번호]

In [121]:
import pandas as pd
import numpy as np
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['20010101','20000503', '19970709',
                 '19990601','19980912', '20021224'],
        '성별' : ['남', '여','여','남','여','남']}
df = pd.DataFrame(data, index=['영', '일', '이', '삼', '사', '오'])
df

    이름  나이      생년월일 성별
영  홍길동  21  20010101  남
일  이순신  22  20000503  여
이  김유신  25  19970709  여
삼  정이동  23  19990601  남
사  이순진  24  19980912  여
오  박유정  20  20021224  남

In [122]:
df.iloc[-1]  # df.iloc[-1] -1은 맨 마지막 행을 의미

이름           박유정
나이            20
생년월일    20021224
성별             남
Name: 오, dtype: object

In [123]:
df.iloc[1:3]

    이름  나이      생년월일 성별
일  이순신  22  20000503  여
이  김유신  25  19970709  여

In [124]:
df.iloc[0, 0]  #인덱스 0행, 인덱스 0열 의미

'홍길동'

In [125]:
df.iloc[[0], [0]]  #인덱스 0행, 인덱스 0열 의미 : 데이터프레임 형태로

    이름
영  홍길동

In [126]:
df.iloc[1:, 0] # 시리즈 형태로 : 인덱스 1행 부터 끝까지 인덱스 0열 표시

일    이순신
이    김유신
삼    정이동
사    이순진
오    박유정
Name: 이름, dtype: object

In [127]:
df.iloc[:,0] # 모든행의 인덱스 0열 표시

영    홍길동
일    이순신
이    김유신
삼    정이동
사    이순진
오    박유정
Name: 이름, dtype: object

In [128]:
df.iloc[[1, 0]] # 데이터프레임 형태로 인덱스 1행, 0행 순서로 표시

    이름  나이      생년월일 성별
일  이순신  22  20000503  여
영  홍길동  21  20010101  남

In [129]:
df.iloc[:,[0]] # 데이터프레임 형태로 인덱스 0열의 모든 행 표시

    이름
영  홍길동
일  이순신
이  김유신
삼  정이동
사  이순진
오  박유정

In [130]:
df.iloc[:,[0,2]]

    이름      생년월일
영  홍길동  20010101
일  이순신  20000503
이  김유신  19970709
삼  정이동  19990601
사  이순진  19980912
오  박유정  20021224

#### 조건을 이용한 선택
- 비교, &(and), |(or)
- 특정 조건 : isin 
  - 데이터프레임의 컬럼에서 어떤 리스트의 값을 포함하고 있는지 판단
  - 해당 값이 있으면 True, False 반환

In [131]:
import pandas as pd
import numpy as np
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'],
        '나이': [21, 22, 25, 23, 24, 20],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
                 '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일']}
frame = pd.DataFrame(data)
frame

    이름  나이           생년월일
0  홍길동  21    2001년 1월 1일
1  이순신  22    2000년 5월 3일
2  김유신  25    1997년 7월 9일
3  정이동  23    1999년 6월 1일
4  이순진  24   1998년 9월 12일
5  박유정  20  2002년 12월 24일

In [132]:
frame.insert(1, '성별', ['남','남','남','여','여','여'])
frame

    이름 성별  나이           생년월일
0  홍길동  남  21    2001년 1월 1일
1  이순신  남  22    2000년 5월 3일
2  김유신  남  25    1997년 7월 9일
3  정이동  여  23    1999년 6월 1일
4  이순진  여  24   1998년 9월 12일
5  박유정  여  20  2002년 12월 24일

In [133]:
frame['나이'] > 22

0    False
1    False
2     True
3     True
4     True
5    False
Name: 나이, dtype: bool

In [134]:
frame[frame['나이'] > 22]

    이름 성별  나이          생년월일
2  김유신  남  25   1997년 7월 9일
3  정이동  여  23   1999년 6월 1일
4  이순진  여  24  1998년 9월 12일

In [135]:
frame[frame.나이 > 22]

    이름 성별  나이          생년월일
2  김유신  남  25   1997년 7월 9일
3  정이동  여  23   1999년 6월 1일
4  이순진  여  24  1998년 9월 12일

In [136]:
frame[(frame['나이'] > 22) & (frame['성별'] == '남')]

    이름 성별  나이         생년월일
2  김유신  남  25  1997년 7월 9일

In [137]:
frame[(frame.나이 > 22) & (frame.성별 == '남')]

    이름 성별  나이         생년월일
2  김유신  남  25  1997년 7월 9일

In [138]:
frame['성별'].isin(['여'])

0    False
1    False
2    False
3     True
4     True
5     True
Name: 성별, dtype: bool

In [139]:
frame[frame['성별'].isin(['여'])]

    이름 성별  나이           생년월일
3  정이동  여  23    1999년 6월 1일
4  이순진  여  24   1998년 9월 12일
5  박유정  여  20  2002년 12월 24일

In [141]:
frame['이름'].isin(['이순신','김유신'])

0    False
1     True
2     True
3    False
4    False
5    False
Name: 이름, dtype: bool

In [142]:
frame[frame['이름'].isin(['이순신','김유신'])]

    이름 성별  나이         생년월일
1  이순신  남  22  2000년 5월 3일
2  김유신  남  25  1997년 7월 9일

In [143]:
frame.이름.isin(['홍길동', '김유신'])

0     True
1    False
2     True
3    False
4    False
5    False
Name: 이름, dtype: bool

In [144]:
frame[frame.이름.isin(['홍길동', '김유신'])]

    이름 성별  나이         생년월일
0  홍길동  남  21  2001년 1월 1일
2  김유신  남  25  1997년 7월 9일

In [145]:
frame.isin(['이순신', '김유신'])

      이름     성별     나이   생년월일
0  False  False  False  False
1   True  False  False  False
2   True  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [146]:
frame[frame.isin(['이순신', '김유신'])]

    이름   성별  나이 생년월일
0  NaN  NaN NaN  NaN
1  이순신  NaN NaN  NaN
2  김유신  NaN NaN  NaN
3  NaN  NaN NaN  NaN
4  NaN  NaN NaN  NaN
5  NaN  NaN NaN  NaN

#### 인덱스 정렬(Sorting) : sort_index()

In [147]:
import pandas as pd
import numpy as np
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'], 
        '성별': ['남','남','남','여','여','여'],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
         '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일'],
        '나이': [21, 22, 25, 23, 24, 20]}
frame = pd.DataFrame(data, index=['one', 'two', 'three', 'four','five', 'six'])
frame

        이름 성별           생년월일  나이
one    홍길동  남    2001년 1월 1일  21
two    이순신  남    2000년 5월 3일  22
three  김유신  남    1997년 7월 9일  25
four   정이동  여    1999년 6월 1일  23
five   이순진  여   1998년 9월 12일  24
six    박유정  여  2002년 12월 24일  20

In [148]:
frame.sort_index()

        이름 성별           생년월일  나이
five   이순진  여   1998년 9월 12일  24
four   정이동  여    1999년 6월 1일  23
one    홍길동  남    2001년 1월 1일  21
six    박유정  여  2002년 12월 24일  20
three  김유신  남    1997년 7월 9일  25
two    이순신  남    2000년 5월 3일  22

In [149]:
frame.sort_index(ascending=False) #내림차순 # axis 생략시 0 설정(행방향)

        이름 성별           생년월일  나이
two    이순신  남    2000년 5월 3일  22
three  김유신  남    1997년 7월 9일  25
six    박유정  여  2002년 12월 24일  20
one    홍길동  남    2001년 1월 1일  21
four   정이동  여    1999년 6월 1일  23
five   이순진  여   1998년 9월 12일  24

In [150]:
frame.sort_index(axis=1) # 열방향으로 정렬 : 오름차순

       나이           생년월일 성별   이름
one    21    2001년 1월 1일  남  홍길동
two    22    2000년 5월 3일  남  이순신
three  25    1997년 7월 9일  남  김유신
four   23    1999년 6월 1일  여  정이동
five   24   1998년 9월 12일  여  이순진
six    20  2002년 12월 24일  여  박유정

In [454]:
frame.sort_index(axis='columns')

       나이           생년월일 성별   이름
one    21    2001년 1월 1일  남  홍길동
two    22    2000년 5월 3일  남  이순신
three  25    1997년 7월 9일  남  김유신
four   23    1999년 6월 1일  여  정이동
five   24   1998년 9월 12일  여  이순진
six    20  2002년 12월 24일  여  박유정

In [455]:
frame.sort_index(axis=1, ascending=False) # 열방향으로 정렬 : 내림차순

        이름 성별           생년월일  나이
one    홍길동  남    2001년 1월 1일  21
two    이순신  남    2000년 5월 3일  22
three  김유신  남    1997년 7월 9일  25
four   정이동  여    1999년 6월 1일  23
five   이순진  여   1998년 9월 12일  24
six    박유정  여  2002년 12월 24일  20

#### 값 정렬(Sorting) : sort_values()

In [151]:
import pandas as pd
import numpy as np
data = {'이름': ['홍길동', '이순신', '김유신','정이동', '이순진', '박유정'], 
        '성별': ['남','남','남','여','여','여'],
        '생년월일': ['2001년 1월 1일','2000년 5월 3일', '1997년 7월 9일',
         '1999년 6월 1일','1998년 9월 12일', '2002년 12월 24일'],
        '나이': [21, 22, 25, 23, 24, 20]}
frame = pd.DataFrame(data, index=['one', 'two', 'three', 'four','five', 'six'])
frame

        이름 성별           생년월일  나이
one    홍길동  남    2001년 1월 1일  21
two    이순신  남    2000년 5월 3일  22
three  김유신  남    1997년 7월 9일  25
four   정이동  여    1999년 6월 1일  23
five   이순진  여   1998년 9월 12일  24
six    박유정  여  2002년 12월 24일  20

In [152]:
frame.sort_values(by='이름') # '이름'을 기준으로 정렬

        이름 성별           생년월일  나이
three  김유신  남    1997년 7월 9일  25
six    박유정  여  2002년 12월 24일  20
two    이순신  남    2000년 5월 3일  22
five   이순진  여   1998년 9월 12일  24
four   정이동  여    1999년 6월 1일  23
one    홍길동  남    2001년 1월 1일  21

In [153]:
frame.sort_values(by=['성별', '이름']) #'성별', '이름'으로 정렬

        이름 성별           생년월일  나이
three  김유신  남    1997년 7월 9일  25
two    이순신  남    2000년 5월 3일  22
one    홍길동  남    2001년 1월 1일  21
six    박유정  여  2002년 12월 24일  20
five   이순진  여   1998년 9월 12일  24
four   정이동  여    1999년 6월 1일  23

In [154]:
frame.sort_values(by=['성별', '이름'], ascending=False)

        이름 성별           생년월일  나이
four   정이동  여    1999년 6월 1일  23
five   이순진  여   1998년 9월 12일  24
six    박유정  여  2002년 12월 24일  20
one    홍길동  남    2001년 1월 1일  21
two    이순신  남    2000년 5월 3일  22
three  김유신  남    1997년 7월 9일  25

In [155]:
frame.sort_values(by=['성별', '이름'], ascending=[False, True])

        이름 성별           생년월일  나이
six    박유정  여  2002년 12월 24일  20
five   이순진  여   1998년 9월 12일  24
four   정이동  여    1999년 6월 1일  23
three  김유신  남    1997년 7월 9일  25
two    이순신  남    2000년 5월 3일  22
one    홍길동  남    2001년 1월 1일  21

#### Unique Values, Value Counts, and Membership
- unique(), value_counts(),

In [157]:
obj = pd.Series(['울산','부산','부산','서울','울산','부산','경기','경기','광주'])
obj

0    울산
1    부산
2    부산
3    서울
4    울산
5    부산
6    경기
7    경기
8    광주
dtype: object

In [158]:
obj.describe()

count      9
unique     5
top       부산
freq       3
dtype: object

In [159]:
obj.unique()

array(['울산', '부산', '서울', '경기', '광주'], dtype=object)

In [160]:
# 빈도가 큰순으로 표시
obj.value_counts()

부산    3
울산    2
경기    2
서울    1
광주    1
Name: count, dtype: int64

In [161]:
# 값 순서대로 빈도 표시
pd.Series(obj).value_counts(sort=False)

울산    2
부산    3
서울    1
경기    2
광주    1
Name: count, dtype: int64

#### T(transpose) : 행과 열을 전치(교환) 시킴 : DataFrame.transpose() 또는 DataFrame.T

In [162]:
frame.T

,one,two,three,four,five,six
이름,홍길동,이순신,김유신,정이동,이순진,박유정
성별,남,남,남,여,여,여
생년월일,2001년 1월 1일,2000년 5월 3일,1997년 7월 9일,1999년 6월 1일,1998년 9월 12일,2002년 12월 24일
나이,21,22,25,23,24,20